{
    "rawContent": "<div class=\"post-body\">\n    <figure>\n        <img src=\"https://i.redd.it/63hqxw2o8lh41.jpg\" alt=\"pointer-meme\"/>\n        <figcaption>Pointer meme</figcaption>\n    </figure>\n\n    <h1 id=\"khai-niem\">Con trỏ là gì mà mọi người lại sợ thế nhỉ?</h1>\n\n    <p>\n        Theo Wikipedia, <strong>con trỏ</strong> (pointer) trong khoa học máy tính là một đối tượng ngôn ngữ lập trình,\n        mà giá trị nó chỉ tới giá trị khác được chứa nơi nào đó trong bộ nhớ máy tính sử dụng địa chỉ bộ nhớ. Có vẻ vẫn\n        hơi khó hiểu\n        nếu bạn mới biết tới con trỏ nhỉ.Vậy chúng ta cùng theo dõi hình minh họa dưới đây nha.\n    </p>\n\n    <p>\n        <em>Bài viết hướng tới con trỏ trong ngôn ngữ lập trình C, nếu muốn tìm hiểu về con trỏ trong các ngôn ngữ khác,\n            hãy đọc thêm ở các nguồn <a href=\"#tham-khao\">tham khảo</a> mình để bên dưới nha!</em>\n    </p>\n\n    <figure>\n        <img src=\"https://cdn.programiz.com/sites/tutorial2program/files/cpp-pointer-working.png\"\n             alt=\"pointer-illustration\"/>\n        <figcaption>Ví dụ minh họa về con trỏ (nguồn: programiz.com)</figcaption>\n    </figure>\n\n    <p>\n        Chúng ta hãy cùng quan sát ví dụ trên nhé. Ta có hai biến là <code>pointVar</code> và <code>var</code>, trong đó\n        <code>pointVar</code> là con trỏ-đối tượng chúng ta đang quan tâm. Ta thấy ở biến <code>var</code> có 2 con số,\n        trong đó 5 là giá trị biến, còn <code>0x61ff08</code> là <strong>địa chỉ</strong>lưu\n        trữ biến. Biến <code>pointVar</code> ở đây đang <em>trỏ</em>tới biến <code>var</code>, và nó đang mang giá trị\n        là <code>0x61ff08</code> - chính là <strong>địa chỉ</strong> của biến <code>var</code>. Vậy ta có thể kết luận\n        gì nhỉ?\n    </p>\n\n    <figure>\n        <img src=\"https://media.geeksforgeeks.org/wp-content/uploads/pointers-in-c.png\" alt=\"pointer-illustration-2\"/>\n        <figcaption>Một ví dụ minh họa khác về con trỏ (nguồn: geeksforgeeks.org)</figcaption>\n    </figure>\n\n    <p>\n        Thực chất, hãy hiểu đơn giản con trỏ là cũng chỉ là là biến, cũng có thể khai báo, khởi tạo và lưu trữ giá trị\n        và có địa chỉ của riêng nó. Nhưng biến con trỏ không lưu giá trị bình thường, nó là biến trỏ tới 1 địa chỉ khác,\n        tức mang giá trị là 1 <strong>địa chỉ.</strong>\n    </p>\n\n    <p>\n        Nếu bạn đã có hình dung sơ lược về con trỏ, hãy cùng đi tới một số ví dụ cụ thể về con trỏ trong lập trình C nha\n        !\n    </p>\n\n    <h1 id=\"su-dung-con-tro-trong-c-nhu-nao-nhi\">Sử dụng con trỏ trong C như nào nhỉ? </h1>\n\n    <blockquote>\n        <p>\n            Trước khi đi vào các cú pháp với con trỏ trong C, chúng ta sẽ cùng làm rõ lại một số khái niệm nha:\n        </p>\n        <ol>\n            <li>\n                Giá trị của con trỏ: địa chỉ mà con trỏ trỏ đến.\n            </li>\n            <li>\n                Địa chỉ của con trỏ: địa chỉ của bản thân biến con trỏ đó.\n            </li>\n            <li>\n                Giá trị của biến nơi con trỏ đang trỏ tới.\n            </li>\n            <li>\n                Địa chỉ của biến nơi con trỏ đang trỏ tới = giá trị của con trỏ.\n            </li>\n        </ol>\n    </blockquote>\n\n    <h2 id=\"cu-phap-khai-bao-con-tro\">Cú pháp khai báo con trỏ</h2>\n    <pre><code>kiểu dữ liệu* tên biến</code></pre>\n    <p>Ví dụ một số con trỏ với các kiểu dữ liệu khác nhau:</p>\n\n    <pre><code class=\"language-C\">int *p_i; // khai báo con trỏ để trỏ tới biến kiểu nguyên\nint *p, val; // khai báo con trỏ p kiểu int, biến val (không phải con trỏ) kiểu int\nfloat *p_f; // khai báo con trỏ để trỏ tới biến kiểu thực\nchar *p_char; // khai báo con trỏ để trỏ tới biến kiểu ký tự\nvoid *p_v; // con trỏ kiểu void (không kiểu)</code></pre>\n\n    <h2 id=\"cu-phap-gan-gia-tri-cho-con-tro\">Cú pháp gán giá trị cho con trỏ</h2>\n    <p>Có một điều cần lưu ý khi ta sử dụng con trỏ. Sau khi khai báo con trỏ, ta bắt buộc phải khởi tạo giá trị cho nó.\n        Nếu con trỏ được sử dụng mà không được khởi tạo, giá trị của nó sẽ là giá trị rác, điều này sẽ làm chương trình\n        của chúng ta chạy không\n        đúng, thậm chí là nguy hiểm nếu giá trị rác đó chẳng may lại chính là địa chỉ của 1 biến nào đó chúng ta đang\n        dùng.</p>\n\n    <p>Ta có hai cách gán giá trị cho con trỏ. Bạn có thể khai báo rồi gán giá trị như dưới đây:</p>\n    <pre><code class=\"language-C\">int *p, value;\nvalue = 5;\np = &value; // khởi tạo giá trị cho con trỏ p là địa chỉ của value</code></pre>\n\n    <p>hoặc bạn có thể vừa khai báo vừa gán giá trị như này:</p>\n\n    <pre><code class=\"language-C\">int value = 5;\nint *p = &value; // khai báo con trỏ p và khởi tạo giá trị cho con trỏ là địa chỉ của value</code></pre>\n\n    <blockquote>\n        <p><strong>Lưu ý khi sử dụng con trỏ:</strong></p>\n        <ul>\n            <li>\n                Con trỏ khi khai báo nên được khởi tạo giá trị ngay.\n            </li>\n            <li>\n                Con trỏ kiểu void là loại biến con trỏ tổng quát, nó có thể nhận địa chỉ của biến bất kỳ ở bất cứ kiểu\n                dữ liệu nào.\n            </li>\n        </ul>\n    </blockquote>\n\n    <h1 id=\"tham-khao\">Tham khảo</h1>\n    <p>Vậy thực chất con trỏ cũng không phải là một khái niệm gì đó quá xa vời đúng không nào :3 Thậm chí nhiều lập\n        trình viên khi đã quen thuộc với con trỏ còn ưa thích chúng và sử dụng con trỏ rất nhiều trong các dự án của họ.\n        Nếu bạn muốn đọc thêm con\n        trò, hãy tham khảo một số nguồn sau đây nhá:</p>\n    <ul>\n        <li>\n            <a href=\"https://nguyenvanhieu.vn/con-tro-trong-c/\" target=\"_blank\">Nguồn tham khảo: Chi tiết về con trỏ\n                trong C\n                (nguyenvanhieu.vn)</a>\n        </li>\n        <li>\n            <a href=\"https://vi.wikipedia.org/wiki/Con_tr%E1%BB%8F_(l%E1%BA%ADp_tr%C3%ACnh_m%C3%A1y_t%C3%ADnh)\"\n               target=\"_blank\">Nguồn\n                tham khảo: Con trỏ(lập trình máy tính) (Wikipedia)</a>\n        </li>\n        <li>\n            <a href=\"https://www.geeksforgeeks.org/pointers-in-c-and-c-set-1-introduction-arithmetic-and-array/\"\n               target=\"_blank\">Pointers\n                in C(geeksforgeeks)</a>\n        </li>\n    </ul>\n</div>",
    "authorName": "Do Thi Khanh Linh",
    "timeRelease": "2021-11-07T18:00:00Z",
    "timeCreate": "2021-11-07T17:05:50Z",
    "title": "Con trỏ trong C không khó chút nào!",
    "subTitle": "Trong bài viết, ta sẽ tìm hiểu về khái niệm và cách thức sử dụng con trỏ trong C. Ta sẽ thật sự thấy con trỏ trong C không đáng sợ như chúng ta vẫn nghĩ",
    "coverImgUrl": "https://i.postimg.cc/y6DCFsvk/nh-D-n-tr.jpg",
    "thumbnailImgUrl": "https://i.postimg.cc/c4D3P7fD/pointers-in-c.pngf",
    "blogTag": ["C/C++", "Programming"]
}