{
  "rawContent": "<div class=\"post-body\">\n    <figure>\n        <img\n                src=\"https://i.postimg.cc/gkFv0mg3/244425254-232046135564770-2364688887954380827-n.jpg\"\n        />\n        <figcaption>Cre: Sami 1956</figcaption>\n    </figure>\n    <h1 id=\"pressure-mon-an-tinh-than-cua-sinh-vien-bach-khoa\">Pressure - Món ăn tinh thần của sinh viên Bách Khoa</h1>\n    <p>Nếu các em tân sinh viên nghĩ là đậu đại học là thành công rồi thì xin chia buồn với các em trường nào chứ không\n        phải trường Bách. Bách Khoa có diện tích hàng trăm ngàn mét vuông, vị chi mỗi mét vuông thì sẽ có đến vài người\n        IELTS 8.0, giải nhất quốc gia, huy chương vàng quốc tế, quán quân đường lên đỉnh Olympia, thủ khoa đại học toàn\n        quốc, học song trường,… . Dạo bước trên sân trường mùa thu se se lạnh lá vàng rơi, đừng nhìn thấy cậu kia tóc\n        tai bù xù quần áo lôi thôi mà xem thường nhé vì có thể bạn ấy đang giữ CPA 3 4 năm học gần 4.0 đấy. Hay là nhìn\n        anh kia toàn tham gia tình nguyện hoạt động xã hội chắc không học hành gì cả thì khả năng cao anh ấy vừa mới\n        nhận được học bổng và sinh viên 5 tốt. Peer Pressure - nghe có vẻ là shock đấy nhưng riêng đối với mình hoặc\n        sinh viên Bách Khoa nói riêng thì đó đã là câu chuyện bình thường (được hô hấp chung không khí với các bạn thiệt\n        là giỏi quả thật là một cảm giác tuyệt vời đấy). Mình không biết các bạn ở trường khác xưng hô với các bạn giỏi\n        như nào nhưng ở Bách Khoa tụi mình gọi là IDOL đấy.</p>\n\n    <p>Bách Khoa vui nhất khi nào ? Đương nhiên câu trả lời sẽ là mùa thi rồi. Đến hẹn lại lên, thư viện lại càng đông\n        vui tấp nập tựa như trẩy hội khi hàng hàng lớp lớp sinh viên đến để ôn bài đến mức nhiều hôm mình đến muộn còn\n        không có chỗ để ngồi - kể cả hành lang, huhu. Công nhận thực sự thì kì thi ở trường Bách khó nhưng mà ôn thi rất\n        là vui nhé, bạn bè trao đổi kiểu thích cực, mình khoái nhất vụ đó hihi ^^ </p>\n\n    <p>Thi học kì trường Bách khó ? Vâng, chính xác là như thế. Không hề bất ngờ khi bạn của bạn đi học đầy đủ cả kì,\n        làm bài tập đầy đủ, học sinh yêu quý của thầy cô cuối kì vẫn tạch bình thường; hay kiểu thầy cô bảo đề thi nằm\n        hết trong tập đề cương rồi thi xong vẫn chưa hết bàng hoàng vì cái đề nó lạ lắm; gần đây nhất là kì thi online\n        qua SEB khiến nhiều sinh viên dở khóc dở cười vì cái đề nó lạ lắm , đảo câu khó lên đầu, đề toàn câu khó kiểu\n        một đề trắc nghiệm bằng 3 4 đề tự luận luôn ý. Và vui nhất là bảng điểm để qua môn: 3 điểm giữa kì thì tầm hơn 4\n        điểm cuối kì là qua môn,… những trường hợp dở khóc dở cười khi 10 điểm giữa kì rồi cuối kì 2 thành một nỗi buồn\n        - cười.</p>\n\n    <p>Thi cuối kì xong thì lại mọi người lại bàn tán về việc GPA kì này bao nhiêu, 4.0 không, có bị trượt học bổng loại\n        A không,… Hay những tràng mưa rơi tạch tạch tạch của mấy bạn không may mắn. Thật sự là cảm xúc lẫn lộn nhưng mà\n        vui quá xá luôn á. Tui năm nhất cũng tuyệt vời lắm á, giúp đỡ bạn bè nhiều nè, quen được nhiều anh chị giỏi nè,\n        gặp được những thầy cô tâm huyết, có nhiều người yêu cũ nè, nhiều A nè, CPA 3.5 nè,… 😊 </p>\n\n    <p>Học Bách Khoa vất vả là thế nhưng không phải là không thể chinh phục được, vẫn có rất nhiều bạn được học bổng rồi\n        giỏi các thứ đúng không ? Các bạn hãy thật quyết tâm và tập trung và mục tiêu mình đã chọn vì đây chính là mái\n        trường Bách Khoa trân quý các bạn đã chọn. Chúc các bạn sức khoẻ thật là tốt để vượt qua đại dịch và một năm học\n        mới GPA, CPA thật là cao, thành công nhé !</p>\n    <p><a href=\"https://www.facebook.com/pageofhumanshust\" target=\"_blank\">Humans of HUST</a></p>\n</div>",
  "authorName": "Le Duc Anh Tuan",
  "timeRelease": "2021-11-07T18:30:00Z",
  "timeCreate": "2021-10-04T19:50:00Z",
  "title": "Pressure - Món ăn tinh thần của sinh viên Bách Khoa",
  "subTitle": "Một bài viết nằm trong chuỗi blog của Humans of HUST, chia sẻ những cung bậc cảm xúc của một con người đang sống và trưởng thành tại HUST.",
  "coverImgUrl": "https://i.postimg.cc/xTKnq15f/D2571141-4-F68-4-CDB-93-B7-A0-BFEBC08875-1-201-a.jpg",
  "thumbnailImgUrl": "https://i.postimg.cc/gkFv0mg3/244425254-232046135564770-2364688887954380827-n.jpg",
  "blogTag": ["Humans of HUST", "HUST"]
}